<?php
$str = '"А-ба-ба-га-ла-ма-га"" - відоме українське видавництво()), яке "було засноване" у 1992)( році в місті "Київ"';
echo $str;
echo "\n\n";
$kavychki = substr_count($str, '"');
echo "К-сть лапок: $kavychki ";
if ($kavychki % 2 == 1) {
    echo "Перевірте рядок!! К-сть непарна. Десь незакрита лапка.\n";
} else {
    echo "Ніби все правильно. Проте все ж таки перевірте написання.\n";
}
$balance = 0;
$ok;
 for ($i = 0; $i < strlen($str); $i++) {
    if ($str[$i] === '(') {
        $balance++;
    } elseif ($str[$i] === ')') {
        $balance--;
        if ($balance < 0) {$ok = false;
            break;}
    }
}

if (!$ok || $balance !== 0) {
    echo "УВАГА!! Неправильно стоять дужки! Перевірте написання!\n";
} else {
    echo "З дужками теж все в порядку.\n";
}


